tutorial/CounterFlowFlame2D/CH4_GRI30/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     reactingFoam;

startFrom       startTime;

startTime       1;

stopAt          endTime;

endTime         1.02;

deltaT          2e-4;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           0.4;
libs
(
"libFastChemistryModel.so"
);

functions
{
    #includeFunc Qdot

    /*writeObjects1
    {
        type            writeObjects;

        libs            ("libutilityFunctionObjects.so");

        objects         (RR.CH4 RR.H2O RR.CO2 RR.OH RR.O RR.H RR.CH RR.CH3 RR.CH2O RR.HCO RR.CO Qdot);
        writeOption     anyWrite;
    }*/
    fieldAverage1
    {
        type            fieldAverage;
        libs            ("libfieldFunctionObjects.so");
        enabled         true;
        writeControl    outputTime;
        resetOnRestart  false;
        startTime       1.00;

        mean                yes;
        prime2Mean          yes;

        fields              (CH4 H2O CO2 T OH O H CH CH3 CH2O HCO CO RR.CH4 RR.H2O RR.CO2 HRR RR.OH RR.O RR.H RR.CH RR.CH3 RR.CH2O RR.HCO RR.CO);
    }

}


// ************************************************************************* //
