tutorial/CounterFlowFlame2D/CH4_GRI30/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "constant";
    object          chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


chemistryType
{

    //solver          ode;
  
    //solver          OptRosenbrock34;
    //solver          OptSeulex;
    solver          OptRodas34;
    method          FastChemistryModel;
}

chemistry       on;
Treact          0;
jacobian exact;

initialChemicalTimeStep 1e-07;

odeCoeffs
{
    solver          rodas34;
    //solver          Rosenbrock34;
    //solver          seulex;
    absTol          1e-8;
    relTol          1e-4;
}

OptRosenbrock34Coeffs
{

    absTol          1e-8;
    relTol          1e-4;
}
OptRodas34Coeffs
{

    absTol          1e-8;
    relTol          1e-4;
}
OptSeulexCoeffs
{

    absTol          1e-8;
    relTol          1e-4;
}

#include        "reactions"


// ************************************************************************* //
